artillery/create-post.yml
config:
  target: http://127.0.0.1:4000
  plugins:
    expect: {}
    metrics-by-endpoint: {}
  environments:
    prod:
      target: https://grafbase-load-testing-main-hassy.grafbase.app
      defaults:
        headers:
          x-api-key: "{{ $processEnvironment.GRAFBASE_API_KEY }}"
      phases:
        - duration: 10
          arrivalRate: 1
        # - duration: 60
        #   arrivalRate: 5
        #   rampTo: 10
scenarios:
  - name: create a new post
    flow:
      - log: "API key: {{ $processEnvironment.GRAFBASE_API_KEY }}"
      - post:
          url: "/graphql"
          name: createPost
          json:
            query: |
              mutation {
                postCreate(input: { title: "Grafbase ${{ $randomString(10) }}", url: "https://grafbase.com/{{ $randomString(10) }}" }) {
                  post {
                    id
                  }
                }
              }
          capture:
            - json: $.data.postCreate.post.id
              as: postId
      - post:
          url: "/graphql"
          name: postComment
          json:
            query: |
              mutation {
                commentCreate(
                  input: {
                    message: "I love GraphQL!"
                    post: { link: "{{ postId }}" }
                  }
                  ) {
                   comment {
                     message
                       post {
                       title
                    }
                  }
              }
              }
          expect:
            - statusCode: 200
      - post:
          url: "/graphql"
          name: getPost
          json:
            query: |
              post(by: { id: "{{ postId }}" }) {
                title
                url
              }
              }